E0=8.854187817*10^(-12); %真空介电常数
Er=81; %溶液相对介电常数
k=1/(7.89*10^(-9)); %德拜长度
zeta=-0.015; %ZETA电位
kB=1.380649*10^(-23); % 玻尔兹曼常数
T=298; %温度
p=50;
e=1.6*10^(-19);
syms R
R=solve(4/3*pi*R^3*p*9.8-zeta*k*64*3.14*E0*Er*R*(kB*T/e)^2*tanh(0.015*e/(4*kB*T)));
R1=abs(R)
Fg=4/3*pi*R.^3*p*9.8;

%%
E0=8.854187817*10^(-12); %真空介电常数
Er=81; %溶液相对介电常数
k=1/(7.89*10^(-9)); %德拜长度
zeta=-0.015; %ZETA电位
kB=1.380649*10^(-23); % 玻尔兹曼常数
T=298; %温度
p=50;
e=1.6*10^(-19);
syms zete
f=10^(-5)-2*Er*E0*kB*T*k/e*sinh(2*atanh(zete*e^(k*100*10^(-9))));
Z=solve(f==0,zete)
syms R
F=4/3*pi*R^3*p*9.8-Z*k*64*pi*E0*Er*R*(kB*T/e)^2*tanh(0.015*e/(4*kB*T));
r=solve(F==0,R)
Fg=Z*k*64*3.14*E0*Er*r*(kB*T/e)^2*tanh(0.015*e/(4*kB*T));

%%
E0=8.854187817*10^(-12); %真空介电常数
Er=81; %溶液相对介电常数
k=1/(3.5*10^(-9)); %德拜长度
zeta=-0.015; %ZETA电位
kB=1.380649*10^(-23); % 玻尔兹曼常数
T=298; %温度
p=50;
e=1.6*10^(-19);
R=20*10^(-6);
Fg=4/3*pi*R.^3*p*9.8;
ZZ=Fg/(k*64*pi*E0*Er*R*(kB*T/e)^2*tanh(0.015*e/(4*kB*T)));
D=2*Er*E0*kB*T*k/e*sinh(2*(atanh(ZZ*e^(k*100*10^(-9)))));

%%
E0=8.854187817*10^(-12); %真空介电常数
Er=81; %溶液相对介电常数
k=1/(3.5*10^(-9)); %德拜长度
zeta=-0.015; %ZETA电位
kB=1.380649*10^(-23); % 玻尔兹曼常数
T=298; %温度
p=50;
e=1.6*10^(-19);
syms zete
Z=solve(10^(-5)-2*Er*E0*kB*T*k/e*sinh(2*(atanh(zete*e^(k*100*10^(-9))))))